FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/fmc_reg.h
#define FMC_ISPCTL_BS_Pos            ( 1 )                                                 /*!< FMC_T::ISPCTL: BS Position             */
#define FMC_ISPCTL_BS_Msk            ( 0x1ul << FMC_ISPCTL_BS_Pos )                        /*!< FMC_T::ISPCTL: BS Mask                 */

#define FMC_ISPCTL_APUEN_Pos         ( 3 )                                                 /*!< FMC_T::ISPCTL: APUEN Position          */
#define FMC_ISPCTL_APUEN_Msk         ( 0x1ul << FMC_ISPCTL_APUEN_Pos )                     /*!< FMC_T::ISPCTL: APUEN Mask              */

#define FMC_ISPCTL_CFGUEN_Pos        ( 4 )                                                 /*!< FMC_T::ISPCTL: CFGUEN Position         */
#define FMC_ISPCTL_CFGUEN_Msk        ( 0x1ul << FMC_ISPCTL_CFGUEN_Pos )                    /*!< FMC_T::ISPCTL: CFGUEN Mask             */

#define FMC_ISPCTL_LDUEN_Pos         ( 5 )                                                 /*!< FMC_T::ISPCTL: LDUEN Position          */
#define FMC_ISPCTL_LDUEN_Msk         ( 0x1ul << FMC_ISPCTL_LDUEN_Pos )                     /*!< FMC_T::ISPCTL: LDUEN Mask              */

#define FMC_ISPCTL_ISPFF_Pos         ( 6 )                                                 /*!< FMC_T::ISPCTL: ISPFF Position          */
#define FMC_ISPCTL_ISPFF_Msk         ( 0x1ul << FMC_ISPCTL_ISPFF_Pos )                     /*!< FMC_T::ISPCTL: ISPFF Mask              */

#define FMC_ISPCTL_BL_Pos            ( 16 )                                                /*!< FMC_T::ISPCTL: BL Position             */
#define FMC_ISPCTL_BL_Msk            ( 0x1ul << FMC_ISPCTL_BL_Pos )                        /*!< FMC_T::ISPCTL: BL Mask                 */

#define FMC_ISPCTL_INTEN_Pos         ( 24 )                                                /*!< FMC_T::ISPCTL: INTEN Position          */
#define FMC_ISPCTL_INTEN_Msk         ( 0x1ul << FMC_ISPCTL_INTEN_Pos )                     /*!< FMC_T::ISPCTL: INTEN Mask              */

#define FMC_ISPADDR_ISPADDR_Pos      ( 0 )                                                 /*!< FMC_T::ISPADDR: ISPADDR Position       */
#define FMC_ISPADDR_ISPADDR_Msk      ( 0xfffffffful << FMC_ISPADDR_ISPADDR_Pos )           /*!< FMC_T::ISPADDR: ISPADDR Mask           */

#define FMC_ISPDAT_ISPDAT_Pos        ( 0 )                                                 /*!< FMC_T::ISPDAT: ISPDAT Position         */
#define FMC_ISPDAT_ISPDAT_Msk        ( 0xfffffffful << FMC_ISPDAT_ISPDAT_Pos )             /*!< FMC_T::ISPDAT: ISPDAT Mask             */

#define FMC_ISPCMD_CMD_Pos           ( 0 )                                                 /*!< FMC_T::ISPCMD: CMD Position            */
#define FMC_ISPCMD_CMD_Msk           ( 0x7ful << FMC_ISPCMD_CMD_Pos )                      /*!< FMC_T::ISPCMD: CMD Mask                */

#define FMC_ISPTRG_ISPGO_Pos         ( 0 )                                                 /*!< FMC_T::ISPTRG: ISPGO Position          */
#define FMC_ISPTRG_ISPGO_Msk         ( 0x1ul << FMC_ISPTRG_ISPGO_Pos )                     /*!< FMC_T::ISPTRG: ISPGO Mask              */

#define FMC_ISPSTS_ISPBUSY_Pos       ( 0 )                                                 /*!< FMC_T::ISPSTS: ISPBUSY Position        */
#define FMC_ISPSTS_ISPBUSY_Msk       ( 0x1ul << FMC_ISPSTS_ISPBUSY_Pos )                   /*!< FMC_T::ISPSTS: ISPBUSY Mask            */

#define FMC_ISPSTS_CBS_Pos           ( 2 )                                                 /*!< FMC_T::ISPSTS: CBS Position            */
#define FMC_ISPSTS_CBS_Msk           ( 0x1ul << FMC_ISPSTS_CBS_Pos )                       /*!< FMC_T::ISPSTS: CBS Mask                */

#define FMC_ISPSTS_MBS_Pos           ( 3 )                                                 /*!< FMC_T::ISPSTS: MBS Position            */
#define FMC_ISPSTS_MBS_Msk           ( 0x1ul << FMC_ISPSTS_MBS_Pos )                       /*!< FMC_T::ISPSTS: MBS Mask                */

#define FMC_ISPSTS_FCYCDIS_Pos       ( 4 )                                                 /*!< FMC_T::ISPSTS: FCYCDIS Position        */
#define FMC_ISPSTS_FCYCDIS_Msk       ( 0x1ul << FMC_ISPSTS_FCYCDIS_Pos )                   /*!< FMC_T::ISPSTS: FCYCDIS Mask            */

#define FMC_ISPSTS_PGFF_Pos          ( 5 )                                                 /*!< FMC_T::ISPSTS: PGFF Position           */
#define FMC_ISPSTS_PGFF_Msk          ( 0x1ul << FMC_ISPSTS_PGFF_Pos )                      /*!< FMC_T::ISPSTS: PGFF Mask               */

#define FMC_ISPSTS_ISPFF_Pos         ( 6 )                                                 /*!< FMC_T::ISPSTS: ISPFF Position          */
#define FMC_ISPSTS_ISPFF_Msk         ( 0x1ul << FMC_ISPSTS_ISPFF_Pos )                     /*!< FMC_T::ISPSTS: ISPFF Mask              */

#define FMC_ISPSTS_ALLONE_Pos        ( 7 )                                                 /*!< FMC_T::ISPSTS: ALLONE Position         */
#define FMC_ISPSTS_ALLONE_Msk        ( 0x1ul << FMC_ISPSTS_ALLONE_Pos )                    /*!< FMC_T::ISPSTS: ALLONE Mask             */

#define FMC_ISPSTS_VECMAP_Pos        ( 9 )                                                 /*!< FMC_T::ISPSTS: VECMAP Position         */
#define FMC_ISPSTS_VECMAP_Msk        ( 0x7ffful << FMC_ISPSTS_VECMAP_Pos )                 /*!< FMC_T::ISPSTS: VECMAP Mask             */

#define FMC_ISPSTS_INTFLAG_Pos       ( 24 )                                                /*!< FMC_T::ISPSTS: INTFLAG Position        */
#define FMC_ISPSTS_INTFLAG_Msk       ( 0x1ul << FMC_ISPSTS_INTFLAG_Pos )                   /*!< FMC_T::ISPSTS: INTFLAG Mask            */

#define FMC_CYCCTL_CYCLE_Pos         ( 0 )                                                 /*!< FMC_T::CYCCTL: CYCLE Position          */
#define FMC_CYCCTL_CYCLE_Msk         ( 0xful << FMC_CYCCTL_CYCLE_Pos )                     /*!< FMC_T::CYCCTL: CYCLE Mask              */

#define FMC_CYCCTL_FADIS_Pos         ( 8 )                                                 /*!< FMC_T::CYCCTL: FADIS Position          */
#define FMC_CYCCTL_FADIS_Msk         ( 0x1ul << FMC_CYCCTL_FADIS_Pos )                     /*!< FMC_T::CYCCTL: FADIS Mask              */

#define FMC_KPKEY0_KPKEY0_Pos        ( 0 )                                                 /*!< FMC_T::KPKEY0: KPKEY0 Position         */
#define FMC_KPKEY0_KPKEY0_Msk        ( 0xfffffffful << FMC_KPKEY0_KPKEY0_Pos )             /*!< FMC_T::KPKEY0: KPKEY0 Mask             */

#define FMC_KPKEY1_KPKEY1_Pos        ( 0 )                                                 /*!< FMC_T::KPKEY1: KPKEY1 Position         */
#define FMC_KPKEY1_KPKEY1_Msk        ( 0xfffffffful << FMC_KPKEY1_KPKEY1_Pos )             /*!< FMC_T::KPKEY1: KPKEY1 Mask             */

#define FMC_KPKEY2_KPKEY2_Pos        ( 0 )                                                 /*!< FMC_T::KPKEY2: KPKEY2 Position         */
#define FMC_KPKEY2_KPKEY2_Msk        ( 0xfffffffful << FMC_KPKEY2_KPKEY2_Pos )             /*!< FMC_T::KPKEY2: KPKEY2 Mask             */

#define FMC_KPKEYTRG_KPKEYGO_Pos     ( 0 )                                                 /*!< FMC_T::KPKEYTRG: KPKEYGO Position      */
#define FMC_KPKEYTRG_KPKEYGO_Msk     ( 0x1ul << FMC_KPKEYTRG_KPKEYGO_Pos )                 /*!< FMC_T::KPKEYTRG: KPKEYGO Mask          */

