FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/fmc_reg.h
#define FMC_KPKEYTRG_TCEN_Pos        ( 1 )                                                 /*!< FMC_T::KPKEYTRG: TCEN Position         */
#define FMC_KPKEYTRG_TCEN_Msk        ( 0x1ul << FMC_KPKEYTRG_TCEN_Pos )                    /*!< FMC_T::KPKEYTRG: TCEN Mask             */

#define FMC_KPKEYSTS_KEYBUSY_Pos     ( 0 )                                                 /*!< FMC_T::KPKEYSTS: KEYBUSY Position      */
#define FMC_KPKEYSTS_KEYBUSY_Msk     ( 0x1ul << FMC_KPKEYSTS_KEYBUSY_Pos )                 /*!< FMC_T::KPKEYSTS: KEYBUSY Mask          */

#define FMC_KPKEYSTS_KEYLOCK_Pos     ( 1 )                                                 /*!< FMC_T::KPKEYSTS: KEYLOCK Position      */
#define FMC_KPKEYSTS_KEYLOCK_Msk     ( 0x1ul << FMC_KPKEYSTS_KEYLOCK_Pos )                 /*!< FMC_T::KPKEYSTS: KEYLOCK Mask          */

#define FMC_KPKEYSTS_KEYMATCH_Pos    ( 2 )                                                 /*!< FMC_T::KPKEYSTS: KEYMATCH Position     */
#define FMC_KPKEYSTS_KEYMATCH_Msk    ( 0x1ul << FMC_KPKEYSTS_KEYMATCH_Pos )                /*!< FMC_T::KPKEYSTS: KEYMATCH Mask         */

#define FMC_KPKEYSTS_FORBID_Pos      ( 3 )                                                 /*!< FMC_T::KPKEYSTS: FORBID Position       */
#define FMC_KPKEYSTS_FORBID_Msk      ( 0x1ul << FMC_KPKEYSTS_FORBID_Pos )                  /*!< FMC_T::KPKEYSTS: FORBID Mask           */

#define FMC_KPKEYSTS_KEYFLAG_Pos     ( 4 )                                                 /*!< FMC_T::KPKEYSTS: KEYFLAG Position      */
#define FMC_KPKEYSTS_KEYFLAG_Msk     ( 0x1ul << FMC_KPKEYSTS_KEYFLAG_Pos )                 /*!< FMC_T::KPKEYSTS: KEYFLAG Mask          */

#define FMC_KPKEYSTS_CFGFLAG_Pos     ( 5 )                                                 /*!< FMC_T::KPKEYSTS: CFGFLAG Position      */
#define FMC_KPKEYSTS_CFGFLAG_Msk     ( 0x1ul << FMC_KPKEYSTS_CFGFLAG_Pos )                 /*!< FMC_T::KPKEYSTS: CFGFLAG Mask          */

#define FMC_KPKEYSTS_SBKPBUSY_Pos    ( 8 )                                                 /*!< FMC_T::KPKEYSTS: SBKPBUSY Position     */
#define FMC_KPKEYSTS_SBKPBUSY_Msk    ( 0x1ul << FMC_KPKEYSTS_SBKPBUSY_Pos )                /*!< FMC_T::KPKEYSTS: SBKPBUSY Mask         */

#define FMC_KPKEYSTS_SBKPFLAG_Pos    ( 9 )                                                 /*!< FMC_T::KPKEYSTS: SBKPFLAG Position     */
#define FMC_KPKEYSTS_SBKPFLAG_Msk    ( 0x1ul << FMC_KPKEYSTS_SBKPFLAG_Pos )                /*!< FMC_T::KPKEYSTS: SBKPFLAG Mask         */

#define FMC_KPKEYCNT_KPKECNT_Pos     ( 0 )                                                 /*!< FMC_T::KPKEYCNT: KPKECNT Position      */
#define FMC_KPKEYCNT_KPKECNT_Msk     ( 0x3ful << FMC_KPKEYCNT_KPKECNT_Pos )                /*!< FMC_T::KPKEYCNT: KPKECNT Mask          */

#define FMC_KPKEYCNT_KPKEMAX_Pos     ( 8 )                                                 /*!< FMC_T::KPKEYCNT: KPKEMAX Position      */
#define FMC_KPKEYCNT_KPKEMAX_Msk     ( 0x3ful << FMC_KPKEYCNT_KPKEMAX_Pos )                /*!< FMC_T::KPKEYCNT: KPKEMAX Mask          */

#define FMC_KPCNT_KPCNT_Pos          ( 0 )                                                 /*!< FMC_T::KPCNT: KPCNT Position           */
#define FMC_KPCNT_KPCNT_Msk          ( 0xful << FMC_KPCNT_KPCNT_Pos )                      /*!< FMC_T::KPCNT: KPCNT Mask               */

#define FMC_KPCNT_KPMAX_Pos          ( 8 )                                                 /*!< FMC_T::KPCNT: KPMAX Position           */
#define FMC_KPCNT_KPMAX_Msk          ( 0xful << FMC_KPCNT_KPMAX_Pos )                      /*!< FMC_T::KPCNT: KPMAX Mask               */

#define FMC_MPDAT0_ISPDAT0_Pos       ( 0 )                                                 /*!< FMC_T::MPDAT0: ISPDAT0 Position        */
#define FMC_MPDAT0_ISPDAT0_Msk       ( 0xfffffffful << FMC_MPDAT0_ISPDAT0_Pos )            /*!< FMC_T::MPDAT0: ISPDAT0 Mask            */

#define FMC_MPDAT1_ISPDAT1_Pos       ( 0 )                                                 /*!< FMC_T::MPDAT1: ISPDAT1 Position        */
#define FMC_MPDAT1_ISPDAT1_Msk       ( 0xfffffffful << FMC_MPDAT1_ISPDAT1_Pos )            /*!< FMC_T::MPDAT1: ISPDAT1 Mask            */

#define FMC_MPDAT2_ISPDAT2_Pos       ( 0 )                                                 /*!< FMC_T::MPDAT2: ISPDAT2 Position        */
#define FMC_MPDAT2_ISPDAT2_Msk       ( 0xfffffffful << FMC_MPDAT2_ISPDAT2_Pos )            /*!< FMC_T::MPDAT2: ISPDAT2 Mask            */

#define FMC_MPDAT3_ISPDAT3_Pos       ( 0 )                                                 /*!< FMC_T::MPDAT3: ISPDAT3 Position        */
#define FMC_MPDAT3_ISPDAT3_Msk       ( 0xfffffffful << FMC_MPDAT3_ISPDAT3_Pos )            /*!< FMC_T::MPDAT3: ISPDAT3 Mask            */

#define FMC_MPSTS_MPBUSY_Pos         ( 0 )                                                 /*!< FMC_T::MPSTS: MPBUSY Position          */
#define FMC_MPSTS_MPBUSY_Msk         ( 0x1ul << FMC_MPSTS_MPBUSY_Pos )                     /*!< FMC_T::MPSTS: MPBUSY Mask              */

#define FMC_MPSTS_PPGO_Pos           ( 1 )                                                 /*!< FMC_T::MPSTS: PPGO Position            */
#define FMC_MPSTS_PPGO_Msk           ( 0x1ul << FMC_MPSTS_PPGO_Pos )                       /*!< FMC_T::MPSTS: PPGO Mask                */

#define FMC_MPSTS_ISPFF_Pos          ( 2 )                                                 /*!< FMC_T::MPSTS: ISPFF Position           */
#define FMC_MPSTS_ISPFF_Msk          ( 0x1ul << FMC_MPSTS_ISPFF_Pos )                      /*!< FMC_T::MPSTS: ISPFF Mask               */

#define FMC_MPSTS_D0_Pos             ( 4 )                                                 /*!< FMC_T::MPSTS: D0 Position              */
#define FMC_MPSTS_D0_Msk             ( 0x1ul << FMC_MPSTS_D0_Pos )                         /*!< FMC_T::MPSTS: D0 Mask                  */

#define FMC_MPSTS_D1_Pos             ( 5 )                                                 /*!< FMC_T::MPSTS: D1 Position              */
#define FMC_MPSTS_D1_Msk             ( 0x1ul << FMC_MPSTS_D1_Pos )                         /*!< FMC_T::MPSTS: D1 Mask                  */

#define FMC_MPSTS_D2_Pos             ( 6 )                                                 /*!< FMC_T::MPSTS: D2 Position              */
#define FMC_MPSTS_D2_Msk             ( 0x1ul << FMC_MPSTS_D2_Pos )                         /*!< FMC_T::MPSTS: D2 Mask                  */

#define FMC_MPSTS_D3_Pos             ( 7 )                                                 /*!< FMC_T::MPSTS: D3 Position              */
#define FMC_MPSTS_D3_Msk             ( 0x1ul << FMC_MPSTS_D3_Pos )                         /*!< FMC_T::MPSTS: D3 Mask                  */

#define FMC_MPADDR_MPADDR_Pos        ( 0 )                                                 /*!< FMC_T::MPADDR: MPADDR Position         */
#define FMC_MPADDR_MPADDR_Msk        ( 0xfffffffful << FMC_MPADDR_MPADDR_Pos )             /*!< FMC_T::MPADDR: MPADDR Mask             */

#define FMC_XOMR0STS_SIZE_Pos        ( 0 )                                                 /*!< FMC_T::XOMR0STS: SIZE Position         */
#define FMC_XOMR0STS_SIZE_Msk        ( 0xfful << FMC_XOMR0STS_SIZE_Pos )                   /*!< FMC_T::XOMR0STS: SIZE Mask             */

#define FMC_XOMR0STS_BASE_Pos        ( 8 )                                                 /*!< FMC_T::XOMR0STS: BASE Position         */
#define FMC_XOMR0STS_BASE_Msk        ( 0xfffffful << FMC_XOMR0STS_BASE_Pos )               /*!< FMC_T::XOMR0STS: BASE Mask             */

#define FMC_XOMR1STS_SIZE_Pos        ( 0 )                                                 /*!< FMC_T::XOMR1STS: SIZE Position         */
#define FMC_XOMR1STS_SIZE_Msk        ( 0xfful << FMC_XOMR1STS_SIZE_Pos )                   /*!< FMC_T::XOMR1STS: SIZE Mask             */

#define FMC_XOMR1STS_BASE_Pos        ( 8 )                                                 /*!< FMC_T::XOMR1STS: BASE Position         */
#define FMC_XOMR1STS_BASE_Msk        ( 0xfffffful << FMC_XOMR1STS_BASE_Pos )               /*!< FMC_T::XOMR1STS: BASE Mask             */

